# Project: Titanic Survival Prediction
In this project, we will create a Logistic Regression model that predicts which passengers survived the sinking of the Titanic, based on features like age and class.

The data is provided by Kaggle here: https://www.kaggle.com/c/titanic/data#_=_

## Part 1: Load and clean the data

In [24]:
import pandas as pd
import numpy as np

In [25]:
# load the data
passengers = pd.read_csv('13 ML_LogesticRegression_KaggleChallengeTitanicSurvivalPredictionTrainDataset.csv')
passengers.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
# sex will be a feature. We transfrom into numbers 
passengers.Sex.replace(to_replace=dict(female=1, male=0), inplace=True)
passengers.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",0,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",0,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",0,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",1,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",1,14.0,1,0,237736,30.0708,NaN,C

In [27]:
# Age will be another feature. We need to replace missing values with average age 

# check NaN values and replace them with 0 (becuase we can't make average on NaN)
passengers.Age.isna().any()
passengers.fillna({'Age':0}, inplace=True)
# replace all NAN values with the average of the column
passengers.loc[passengers.Age == 0] = passengers['Age'].mean()
passengers.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1.000000,0.000000,3.000000,"Braund, Mr. Owen Harris",0.000000,22.000000,1.000000,0.000000,A/5 21171,7.250000,NaN,S
1,2.000000,1.000000,1.000000,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1.000000,38.000000,1.000000,0.000000,PC 17599,71.283300,C85,C
2,3.000000,1.000000,3.000000,"Heikkinen, Miss. Laina",1.000000,26.000000,0.000000,0.000000,STON/O2. 3101282,7.925000,NaN,S
3,4.000000,1.000000,1.000000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1.000000,35.000000,1.000000,0.000000,113803,53.100000,C123,S
4,5.000000,0.000000,3.000000,"Allen, Mr. William Henry",0.000000,35.000000,0.000000,0.000000,373450,8.050000,NaN,S
5,23.799293,23.799293,23.799293,23.7993,23.799293,23.799293,23.799293,23.799293,23.7993,23.799293,23.7993,23.7993
6,7.000000,0.000000,1.000000,"McCarthy, Mr. Timothy J",0.000000,54.000000,0.000000,0.000000,17463,51.862500,E46,S
7,8.000000,0.000000,3.000000,"Palsson, Master. Gosta Leonard",0.000000,2.000000,3.000000,1.000000,349909,21.075000,NaN,S
8,9.000000,1.000000,3.000000,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",1.000000,27.000000,0.000000,2.000000,347742,11.133300,NaN,S
9,10.000000,1.000000,2.000000,"Nasser, Mrs. Nicholas (Adele Achem)",1.000000,14.000000,1.000000,0.000000,237736,30.070800,NaN,C

## Part 2:

## Part 3:

## Part 4: